app/controllers/contact_controller.rb

INSERT INTO "contacts" ("name", "phone", "address", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sam"], ["phone", "7404052486"], ["address", "Mack Hall"], ["email", "yinger.18@osu.edu"], ["created_at", 2016-12-01 22:19:15 UTC], ["updated_at", 2016-12-01 22:19:15 UTC]]
INSERT INTO "events" ("leadership", "baptisms", "other", "journey", "created_at", "updated_at", "contact_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["leadership", true], ["baptisms", true], ["other", ""], ["journey", true], ["created_at", 2016-12-02 03:05:01 UTC], ["updated_at", 2016-12-02 03:05:01 UTC], ["contact_id", 3]]
INSERT INTO "personalities" ("gender", "year", "greek", "member", "source", "groups", "created_at", "updated_at", "contact_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "prayers" ("prayer", "comments", "created_at", "updated_at", "contact_id") VALUES (?, ?, ?, ?, ?)  [["prayer", ""], ["comments", ""], ["created_at", 2016-12-01 22:19:15 UTC], ["updated_at", 2016-12-01 22:19:15 UTC], ["contact_id", 1]]
---
  def create
    if session[:return_to] == nil
      session[:return_to] = '/'
    end
    @contact = Contact.new
    @contact.event = Event.new
    @contact.personality = Personality.new
    @contact.prayer = Prayer.new
    @contact.service = Service.new
    contact_params
    event_params
    personality_params
    prayer_params
    service_params
    if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    session[:return_to] ||= request.referer
    @contact = Contact.find(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "contacts" SET "address" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["address", "djfdjytdrjs"], ["updated_at", 2016-12-02 03:10:51 UTC], ["id", 4]]
---
  def update
    if session[:return_to] == nil
      session[:return_to] = '/'
    end
    @contact = Contact.find(params[:id])
    contact_params
    event_params
    personality_params
    prayer_params
    service_params
    if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 2]]
---
  def destroy
    respond_to do |format|
      @contact = Contact.find(params[:id])
      @contact.destroy

SELECT "contacts".* FROM "contacts" WHERE (name LIKE '%%')
SELECT COUNT(*) FROM "contacts" WHERE (name LIKE '%Sam%')
---
  def find
    @contacts = Contact.where('name LIKE ?', "%#{params[:name]}%").page(params[:page]).per(10)

SELECT "contacts".* FROM "contacts" INNER JOIN "events" ON "events"."contact_id" = "contacts"."id" WHERE "events"."{:other=>""""}" = ? ORDER BY created_at ASC  [["{:other=>\"\"}", false]]
SELECT "contacts".* FROM "contacts" INNER JOIN "events" ON "events"."contact_id" = "contacts"."id" WHERE "events"."family" = ? ORDER BY created_at ASC  [["family", true]]
SELECT "contacts".* FROM "contacts" INNER JOIN "events" ON "events"."contact_id" = "contacts"."id" WHERE "events"."mission" = ? ORDER BY created_at ASC  [["mission", true]]
SELECT "contacts".* FROM "contacts" INNER JOIN "events" ON "events"."contact_id" = "contacts"."id" WHERE "events"."baptisms" = ? ORDER BY created_at ASC  [["baptisms", true]]
SELECT "contacts".* FROM "contacts" INNER JOIN "events" ON "events"."contact_id" = "contacts"."id" WHERE "events"."journey" = ? ORDER BY created_at ASC  [["journey", true]]
SELECT "contacts".* FROM "contacts" INNER JOIN "events" ON "events"."contact_id" = "contacts"."id" WHERE ("events"."other" != ?) ORDER BY created_at ASC  [["other", ""]]
SELECT "contacts".* FROM "contacts" INNER JOIN "services" ON "services"."contact_id" = "contacts"."id" WHERE "services"."roadies" = ? ORDER BY created_at ASC  [["roadies", true]]
---
  def filter
    case
      when params[:filter] == '1'
        @contacts = Contact.joins(:event).where(:events => {:teams => true}).order('created_at ASC')
      when params[:filter] == '2'
        @contacts = Contact.joins(:event).where(:events => {:family => true}).order('created_at ASC')
      when params[:filter] == '3'
        @contacts = Contact.joins(:event).where(:events => {:international => true}).order('created_at ASC')
      when params[:filter] == '4'
        @contacts = Contact.joins(:event).where(:events => {:well => true}).order('created_at ASC')
      when params[:filter] == '5'
        @contacts = Contact.joins(:event).where(:events => {:mission => true}).order('created_at ASC')
      when params[:filter] == '6'
        @contacts = Contact.joins(:event).where(:events => {:leadership => true}).order('created_at ASC')
      when params[:filter] == '7'
        @contacts = Contact.joins(:event).where(:events => {:community => true}).order('created_at ASC')
      when params[:filter] == '8'
        @contacts = Contact.joins(:event).where(:events => {:baptisms => true}).order('created_at ASC')
      when params[:filter] == '9'
        @contacts = Contact.joins(:event).where(:events => {:journey => true}).order('created_at ASC')
      when params[:filter] == '10'
        @contacts = Contact.joins(:event).where.not(:events => {:other => ''}).order('created_at ASC')
      when params[:filter] == '11'
        @contacts = Contact.joins(:event).where(:events => {:email_list => true}).order('created_at ASC')
      when params[:filter] == '12'
        @contacts = Contact.joins(:service).where(:services => {:refreshments => true}).order('created_at ASC')
      when params[:filter] == '13'
        @contacts = Contact.joins(:service).where(:services => {:sound => true}).order('created_at ASC')
      when params[:filter] == '14'
        @contacts = Contact.joins(:service).where(:services => {:roadies => true}).order('created_at ASC')

SELECT "contacts".* FROM "contacts" INNER JOIN "services" ON "services"."contact_id" = "contacts"."id" WHERE "services"."usher" = ? ORDER BY created_at ASC  [["usher", true]]
SELECT "contacts".* FROM "contacts" INNER JOIN "services" ON "services"."contact_id" = "contacts"."id" WHERE "services"."slides" = ? ORDER BY created_at ASC  [["slides", true]]
SELECT "contacts".* FROM "contacts" INNER JOIN "services" ON "services"."contact_id" = "contacts"."id" WHERE "services"."service_slices" = ? ORDER BY created_at ASC  [["service_slices", true]]
---
      when params[:filter] == '17'
        @contacts = Contact.joins(:service).where(:services => {:service_events => true}).order('created_at ASC')
      when params[:filter] == '18'
        @contacts = Contact.joins(:service).where(:services => {:usher => true}).order('created_at ASC')
      when params[:filter] == '19'
        @contacts = Contact.joins(:service).where(:services => {:kids => true}).order('created_at ASC')
      when params[:filter] == '20'
        @contacts = Contact.joins(:service).where(:services => {:slides => true}).order('created_at ASC')
      when params[:filter] == '21'
        @contacts = Contact.joins(:service).where(:services => {:service_slices => true}).order('created_at ASC')

SELECT "contacts".* FROM "contacts" WHERE (international = true) ORDER BY created_at ASC
---
      when params[:filter] == '23'
        @contacts = Contact.joins(:event).where.not(:events => {:other => ''}).order('created_at ASC')
      else
        @contacts = Contact.all.order('created_at ASC')

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "prayers" SET "prayer" = ?, "updated_at" = ? WHERE "prayers"."id" = ?  [["prayer", ""], ["updated_at", 2016-12-02 03:06:30 UTC], ["id", 2]]
---
  def del_prayer
    respond_to do |format|
      @contact = Contact.find(params[:id])
      @contact.prayer.prayer = ''
      @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "prayers" SET "comments" = ?, "updated_at" = ? WHERE "prayers"."id" = ?  [["comments", ""], ["updated_at", 2016-12-02 03:06:39 UTC], ["id", 2]]
---
  def del_comment
    respond_to do |format|
      @contact = Contact.find(params[:id])
      @contact.prayer.comments = ''
      @contact.save